socialNetwork/wrk2/oldies/sn_1phone_r1400.out
Running 1m test @ http://localhost:8080/wrk2-api/post/compose
  2 threads and 10 connections
  Thread calibration: mean lat.: 11.883ms, rate sampling interval: 61ms
  Thread calibration: mean lat.: 11.480ms, rate sampling interval: 59ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    29.67ms  122.22ms 792.58ms   96.83%
    Req/Sec   707.20    394.05     1.52k    92.79%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    6.22ms
 75.000%    9.65ms
 90.000%   18.42ms
 99.000%  792.58ms
 99.900%    1.15s 
 99.990%    1.31s 
 99.999%    1.34s 
100.000%    1.35s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.563     0.000000            1         1.00
       3.531     0.100000         7019         1.11
       4.187     0.200000        14071         1.25
       4.763     0.300000        21089         1.43
       5.411     0.400000        28086         1.67
       6.215     0.500000        35080         2.00
       6.699     0.550000        38604         2.22
       7.267     0.600000        42095         2.50
       7.947     0.650000        45609         2.86
       8.719     0.700000        49125         3.33
       9.655     0.750000        52637         4.00
      10.247     0.775000        54376         4.44
      10.959     0.800000        56126         5.00
      11.799     0.825000        57891         5.71
      12.927     0.850000        59641         6.67
      14.655     0.875000        61388         8.00
      16.071     0.887500        62264         8.89
      18.415     0.900000        63141        10.00
      21.759     0.912500        64017        11.43
      28.815     0.925000        64895        13.33
      42.495     0.937500        65773        16.00
      52.351     0.943750        66211        17.78
      64.447     0.950000        66649        20.00
      79.359     0.956250        67086        22.86
      98.815     0.962500        67525        26.67
     162.559     0.968750        67963        32.00
     272.383     0.971875        68182        35.56
     386.815     0.975000        68403        40.00
     475.391     0.978125        68621        45.71
     545.791     0.981250        68842        53.33
     620.543     0.984375        69060        64.00
     667.647     0.985938        69169        71.11
     710.143     0.987500        69280        80.00
     755.711     0.989062        69388        91.43
     817.151     0.990625        69500       106.67
     881.663     0.992188        69607       128.00
     903.679     0.992969        69663       142.22
     928.255     0.993750        69720       160.00
     946.687     0.994531        69773       182.86
     976.383     0.995313        69828       213.33
    1003.007     0.996094        69881       256.00
    1016.831     0.996484        69912       284.44
    1028.095     0.996875        69936       320.00
    1038.847     0.997266        69965       365.71
    1061.887     0.997656        69992       426.67
    1090.559     0.998047        70022       512.00
    1098.751     0.998242        70032       568.89
    1118.207     0.998437        70046       640.00
    1126.399     0.998633        70060       731.43
    1138.687     0.998828        70074       853.33
    1154.047     0.999023        70087      1024.00
    1163.263     0.999121        70096      1137.78
    1168.383     0.999219        70102      1280.00
    1176.575     0.999316        70109      1462.86
    1186.815     0.999414        70114      1706.67
    1204.223     0.999512        70121      2048.00
    1206.271     0.999561        70125      2275.56
    1212.415     0.999609        70128      2560.00
    1223.679     0.999658        70132      2925.71
    1239.039     0.999707        70135      3413.33
    1247.231     0.999756        70138      4096.00
    1262.591     0.999780        70140      4551.11
    1290.239     0.999805        70142      5120.00
    1294.335     0.999829        70144      5851.43
    1301.503     0.999854        70145      6826.67
    1305.599     0.999878        70147      8192.00
    1307.647     0.999890        70148      9102.22
    1308.671     0.999902        70149     10240.00
    1318.911     0.999915        70152     11702.86
    1318.911     0.999927        70152     13653.33
    1318.911     0.999939        70152     16384.00
    1318.911     0.999945        70152     18204.44
    1318.911     0.999951        70152     20480.00
    1326.079     0.999957        70153     23405.71
    1326.079     0.999963        70153     27306.67
    1326.079     0.999969        70153     32768.00
    1344.511     0.999973        70154     36408.89
    1344.511     0.999976        70154     40960.00
    1344.511     0.999979        70154     46811.43
    1344.511     0.999982        70154     54613.33
    1344.511     0.999985        70154     65536.00
    1349.631     0.999986        70155     72817.78
    1349.631     1.000000        70155          inf
#[Mean    =       29.671, StdDeviation   =      122.217]
#[Max     =     1348.608, Total count    =        70155]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  84097 requests in 1.00m, 17.64MB read
  Non-2xx or 3xx responses: 84097
Requests/sec:   1401.60
Transfer/sec:    301.13KB